bin/saascom_chrome_testing-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: saascom_chrome testing-Selenium
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: saascom_chrome testing-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  saascom_chrome testing-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1536,753)
      - go(https://chrome.google.com/webstore/detail/blazemeter-the-continuous/mbopgmdnpcbohhpnfglgohlbhfongabi/related)
      - go(https://www.automationexercise.com/)
      - clickByXPath(//*[text() = " Products"])
      - clickByXPath(//*[text() = "Cart"])
      - clickByXPath(//*[text() = " Products"])
      - clickByXPath((//*[text() = "Add to cart"])[2])
      - clickByXPath(//*[text() = "Continue Shopping"])
      - clickByXPath((//*[text() = "Add to cart"])[4])
      - clickByXPath(//*[text() = "Continue Shopping"])
      - clickByXPath((//*[text() = "Add to cart"])[6])
      - clickByXPath(//*[text() = "View Cart"])
      - clickByXPath(//*[text() = "Proceed To Checkout"])
      - clickByXPath(//*[text() = "Register / Login"])
      - clickByXPath(//input[@placeholder = "Email Address"])
      - typeByXPath(//input[@placeholder = "Email Address"]): "cetineronur44@gmail.com"
      - typeSecretXPath(//input[@placeholder = "Password"]): "123456"
      - clickByXPath(//*[text() = "Login"])
      - clickByXPath(//*[text() = "Cart"])
      - clickByXPath(//*[text() = "Proceed To Checkout"])
      - clickByXPath(//*[text() = "Place Order"])

  saascom_chrome testing-Http:
    headers:
      sec-ch-ua: '"Google Chrome";v="113", "Chromium";v="113", "Not-A.Brand";v="24"'
      sec-ch-ua-mobile: '?0'
      sec-ch-ua-platform: '"Windows"'
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/113.0.0.0 Safari/537.36'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'https://www.automationexercise.com/'
            method: GET
            label: 'https://www.automationexercise.com/'
            think-time: 0ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7'
          - url: 'https://pagead2.googlesyndication.com/getconfig/sodar'
            method: GET
            label: 'https://pagead2.googlesyndication.com/getconfig/sodar'
            headers:
              Accept: '*/*'
            body:
              sv: '200'
              tid: gda
              tv: r20230531
              st: env
          - url: 'https://www.automationexercise.com/products'
            method: GET
            label: 'https://www.automationexercise.com/products'
            think-time: 4145ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7'
          - url: 'https://pagead2.googlesyndication.com/getconfig/sodar'
            method: GET
            label: 'https://pagead2.googlesyndication.com/getconfig/sodar'
            headers:
              Accept: '*/*'
            body:
              sv: '200'
              tid: gda
              tv: r20230531
              st: env
          - url: 'https://www.automationexercise.com/view_cart'
            method: GET
            label: 'https://www.automationexercise.com/view_cart'
            think-time: 1098ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7'
          - url: 'https://pagead2.googlesyndication.com/getconfig/sodar'
            method: GET
            label: 'https://pagead2.googlesyndication.com/getconfig/sodar'
            headers:
              Accept: '*/*'
            body:
              sv: '200'
              tid: gda
              tv: r20230531
              st: env
          - url: 'https://www.automationexercise.com/products'
            method: GET
            label: 'https://www.automationexercise.com/products'
            think-time: 3306ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7'
          - url: 'https://www.automationexercise.com/add_to_cart/1'
            method: GET
            label: 'https://www.automationexercise.com/add_to_cart/1'
            headers:
              Accept: '*/*'
              X-Requested-With: XMLHttpRequest
          - url: 'https://pagead2.googlesyndication.com/getconfig/sodar'
            method: GET
            label: 'https://pagead2.googlesyndication.com/getconfig/sodar'
            headers:
              Accept: '*/*'
            body:
              sv: '200'
              tid: gda
              tv: r20230531
              st: env
          - url: 'https://www.automationexercise.com/add_to_cart/2'
            method: GET
            label: 'https://www.automationexercise.com/add_to_cart/2'
            headers:
              Accept: '*/*'
              X-Requested-With: XMLHttpRequest
          - url: 'https://www.automationexercise.com/add_to_cart/3'
            method: GET
            label: 'https://www.automationexercise.com/add_to_cart/3'
            headers:
              Accept: '*/*'
              X-Requested-With: XMLHttpRequest
          - url: 'https://www.automationexercise.com/view_cart'
            method: GET
            label: 'https://www.automationexercise.com/view_cart'
            think-time: 2636ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7'
          - url: 'https://pagead2.googlesyndication.com/getconfig/sodar'
            method: GET
            label: 'https://pagead2.googlesyndication.com/getconfig/sodar'
            headers:
              Accept: '*/*'
            body:
              sv: '200'
              tid: gda
              tv: r20230531
              st: env
          - url: 'https://www.automationexercise.com/login'
            method: GET
            label: 'https://www.automationexercise.com/login'
            think-time: 6292ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7'
          - url: 'https://pagead2.googlesyndication.com/getconfig/sodar'
            method: GET
            label: 'https://pagead2.googlesyndication.com/getconfig/sodar'
            headers:
              Accept: '*/*'
            body:
              sv: '200'
              tid: gda
              tv: r20230531
              st: env
          - url: 'https://www.automationexercise.com/login'
            method: POST
            label: 'https://www.automationexercise.com/login'
            think-time: 12894ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Content-Type: application/x-www-form-urlencoded
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7'
            body:
              csrfmiddlewaretoken: rK9FJ6KARmCXSKbthmlDgNxled7VCIq1bgH2h4EeebgQfEnO5wYCFWEoutifgyPh
              email: cetineronur44@gmail.com
              password: '123456'
          - url: 'https://pagead2.googlesyndication.com/getconfig/sodar'
            method: GET
            label: 'https://pagead2.googlesyndication.com/getconfig/sodar'
            headers:
              Accept: '*/*'
            body:
              sv: '200'
              tid: gda
              tv: r20230531
              st: env
          - url: 'https://www.automationexercise.com/view_cart'
            method: GET
            label: 'https://www.automationexercise.com/view_cart'
            think-time: 13460ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7'
          - url: 'https://pagead2.googlesyndication.com/getconfig/sodar'
            method: GET
            label: 'https://pagead2.googlesyndication.com/getconfig/sodar'
            headers:
              Accept: '*/*'
            body:
              sv: '200'
              tid: gda
              tv: r20230531
              st: env
          - url: 'https://www.automationexercise.com/checkout'
            method: GET
            label: 'https://www.automationexercise.com/checkout'
            think-time: 930ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7'
          - url: 'https://www.automationexercise.com/payment'
            method: GET
            label: 'https://www.automationexercise.com/payment'
            think-time: 5082ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7'
          - url: 'https://pagead2.googlesyndication.com/getconfig/sodar'
            method: GET
            label: 'https://pagead2.googlesyndication.com/getconfig/sodar'
            headers:
              Accept: '*/*'
            body:
              sv: '200'
              tid: gda
              tv: r20230531
              st: env